In [1]:
import pandas as pd 
import numpy as np

In [3]:
arr = np.random.randint(1,300,500)
arr

# find out the average of those elements that are greater than 50 and less than 150 
# and also return the no. of elements that satisfie our condition

array([ 35, 179, 264, 173, 148, 256, 144,  42, 149, 103, 185,  56,  74,
       143, 102, 108,  37,  53,  89, 200,  73, 224,  19,  15,  93, 211,
       240, 208, 139, 163, 283,  99, 263, 197, 212, 196,  25, 165, 296,
        14, 158,  46, 232,  29, 240, 288,  42, 198, 146,  54, 215, 108,
         3,  76, 121, 237, 135, 132, 148, 213, 135, 190, 238, 200, 111,
       235, 208, 182,  36, 297,   1, 183,  97, 267,  70,  30,  52,  22,
       168, 177, 287, 133, 101, 231,  31, 178, 112, 188,  84, 279, 222,
       260, 113,   8, 212,  16, 148, 217,   7, 288, 204, 212, 162, 141,
       229, 198, 244, 229, 180,  71, 265, 199, 164, 174,   2, 149,  46,
       166,  41, 194, 251, 261, 227, 122,  95, 207,  74,  10, 271, 194,
       114,  26,  64, 211,  70,  66, 248, 119,  83, 140, 197, 297, 115,
       170,  56,  91,  22, 139,   3,   9, 181,  37,  87, 145,   2,  22,
         7, 184,  70, 263,  18, 121, 209, 217,  97, 105,  57, 199, 193,
         3, 154,  87, 144, 275, 293, 232, 150, 166,  99, 296, 224,  45,
       214,  49, 139,   3, 175, 232, 117, 262, 192, 212, 232,  80,  47,
        34, 166, 290, 107, 149,  19, 214, 191, 290, 207,  89,  43,  23,
       184, 241, 224,  13,  88, 211,  59,  17, 155, 226, 276, 222, 274,
       163, 121,  70, 182, 201, 232, 250, 172, 255, 174, 296, 256,   5,
       209,  91, 247, 186, 123, 174, 264, 179,  89,  94,  77, 172, 177,
        30, 100, 296,  86, 116, 192, 218, 211, 275,  16, 172,   7, 194,
        19, 295, 274, 228,  13, 170, 164, 186,   1, 103,  59,  87,  10,
       230, 109, 228, 272, 209,  26, 275,  53, 212,  13, 254, 102, 198,
       122,  68,  94, 213, 274,  92, 165, 280,  58, 211, 157, 115,  28,
        45, 149, 122, 135, 280, 160, 174, 179, 197,  23, 106, 114, 114,
       244, 238,  50,  82,  22,  48,  96, 100,  49, 289, 241, 291, 292,
         1,  38, 238, 149,  99, 296, 262,  77,  16, 186,  32, 244,  91,
       174, 133,  61, 299, 203,  63, 110,  19,  46, 112, 239, 141, 136,
       241, 122, 149,  67, 123,  29, 211, 272, 240, 169, 187, 136,  27,
       125,  85, 126,  33, 230, 161, 182, 294,  14,  79, 149, 175,  93,
        70, 256, 256, 209,  95, 265,  37, 241, 134, 231,  73, 120,  61,
       283, 233,  15,  58, 110, 222,  44, 289,  72, 147, 279, 255,  32,
       286, 116, 169, 106, 168, 188, 241, 161,  67, 219, 123,   4, 200,
       266, 140,  29,  84,  63, 197,   9,  91, 113, 120, 154, 186, 279,
       238, 131, 155, 277, 146, 249, 102,   5, 106, 191, 201,  60,  80,
       124, 229, 141, 280,  56, 160, 248, 203, 143, 139, 169,   4, 207,
        91, 298,  97, 277,  98, 284,  23, 253, 157,  11, 108,  39, 246,
       181, 145,  68,  80,  47,  50,  69, 295, 265, 157,  31,  85, 190,
       168,  61,  16, 165, 159,   2,  29, 181, 282,   5, 207,  68, 154,
       282,  57, 148, 171, 223, 242])

In [6]:
# Data frame create using dictionary 

data = {"Name":['Rishi','Harshit','kartik','yash'],
       "Subject":['physics','chemistry' , 'physics','computer science'],
       "college":['poornima','biet','lord','jecrc']}

data

{'Name': ['Rishi', 'Harshit', 'kartik', 'yash'],
 'Subject': ['physics', 'chemistry', 'physics', 'computer science'],
 'college': ['poornima', 'biet', 'lord', 'jecrc']}

In [5]:
df = pd.DataFrame(data)
df

      Name           Subject   college
0    Rishi           physics  poornima
1  Harshit         chemistry      biet
2   kartik           physics      lord
3     yash  computer science     jecrc

In [8]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df['Name']

0      Rishi
1    Harshit
2     kartik
3       yash
Name: Name, dtype: object

In [11]:
type(df['Name'])

pandas.core.series.Series

In [4]:
import pandas as pd

In [2]:
df = pd.read_csv('Used_Bikes.csv')
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [3]:
df.shape

(32648, 8)

In [6]:
df.duplicated().sum()

25324

In [9]:
df.drop_duplicates(inplace=True)

In [10]:
df.shape

(7324, 8)

In [13]:
df['owner'].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

In [20]:
## column remove and adding columns
df.drop('bike_name',axis='columns')   # to remove sinlge column from the dataframe

,price,city,kms_driven,owner,age,power,brand
0,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...
9362,25000.0,Delhi,48587.0,First Owner,8.0,150.0,Hero
9369,35000.0,Bangalore,60000.0,First Owner,9.0,220.0,Bajaj
9370,450000.0,Jodhpur,3430.0,First Owner,4.0,750.0,Harley-Davidson
9371,139000.0,Hyderabad,21300.0,First Owner,4.0,400.0,Bajaj
9372,80000.0,Hyderabad,7127.0,First Owner,5.0,220.0,Bajaj

In [22]:
df.drop(['bike_name','kms_driven'],axis='columns')   # inplace=True 

# feature , column , variable

         price       city        owner  age  power            brand
0      35000.0  Ahmedabad  First Owner  3.0  110.0              TVS
1     119900.0      Delhi  First Owner  4.0  350.0    Royal Enfield
2     600000.0      Delhi  First Owner  8.0  675.0          Triumph
3      65000.0  Bangalore  First Owner  4.0  180.0              TVS
4      80000.0  Bangalore  First Owner  3.0  150.0           Yamaha
...        ...        ...          ...  ...    ...              ...
9362   25000.0      Delhi  First Owner  8.0  150.0             Hero
9369   35000.0  Bangalore  First Owner  9.0  220.0            Bajaj
9370  450000.0    Jodhpur  First Owner  4.0  750.0  Harley-Davidson
9371  139000.0  Hyderabad  First Owner  4.0  400.0            Bajaj
9372   80000.0  Hyderabad  First Owner  5.0  220.0            Bajaj

[7324 rows x 6 columns]

In [28]:
## adding new columns with scaler value 
df['demo'] = "upflairs"

In [36]:
df['kms_driven'] - 50

0       17604.0
1       10950.0
2          60.0
3       16279.0
4        9950.0
         ...
9362    48537.0
9369    59950.0
9370     3380.0
9371    21250.0
9372     7077.0
Name: kms_driven, Length: 7324, dtype: float64

In [37]:
df['reduced_kms_driven']    =  df['kms_driven'] - 50  # derived a new column from exist column this is called
# featur engineering

In [39]:
"upflairs"   + "pvt"  + "ltd"

'upflairspvtltd'

In [42]:
df['bike_name'].dtype  # object

dtype('O')

In [48]:
df['bike_name_with_brand'] = df['bike_name']   +" " + df['brand']

In [44]:
df.dtypes  # object or string

bike_name              object
price                 float64
city                   object
kms_driven            float64
owner                  object
age                   float64
power                 float64
brand                  object
demo                   object
reduced_kms_driven    float64
dtype: object

In [54]:
df.drop(['demo','reduced_kms_driven','bike_name_with_brand'],axis=1,inplace=True)
# 1 == column 
# 0 == row

In [57]:
  # categorical object and numerical 
df[['bike_name','city','owner','brand']]

,bike_name,city,owner,brand
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS
1,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield
2,Triumph Daytona 675R,Delhi,First Owner,Triumph
3,TVS Apache RTR 180cc,Bangalore,First Owner,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha
...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,Delhi,First Owner,Hero
9369,Bajaj Avenger 220cc,Bangalore,First Owner,Bajaj
9370,Harley-Davidson Street 750 ABS,Jodhpur,First Owner,Harley-Davidson
9371,Bajaj Dominar 400 ABS,Hyderabad,First Owner,Bajaj
9372,Bajaj Avenger Street 220,Hyderabad,First Owner,Bajaj

In [59]:
cat_col = df.select_dtypes(include='O')   # 'O'  ==> object
cat_col.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

In [60]:
num_col = df.select_dtypes(exclude='O')   # 'O'  ==> object
num_col.head()

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [61]:
cat_col.shape

(7324, 4)

In [62]:
num_col.shape

(7324, 4)

In [67]:
combined_df = pd.concat([num_col , cat_col],axis=1)
combined_df.head()

,price,kms_driven,age,power,bike_name,city,owner,brand
0,35000.0,17654.0,3.0,110.0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS
1,119900.0,11000.0,4.0,350.0,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield
2,600000.0,110.0,8.0,675.0,Triumph Daytona 675R,Delhi,First Owner,Triumph
3,65000.0,16329.0,4.0,180.0,TVS Apache RTR 180cc,Bangalore,First Owner,TVS
4,80000.0,10000.0,3.0,150.0,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha

In [ ]:
# pd.merge()  # join

In [69]:
df['owner'].value_counts()

owner
First Owner             6642
Second Owner             588
Third Owner               84
Fourth Owner Or More      10
Name: count, dtype: int64

In [70]:
dt = {'First Owner':1,'Second Owner':2,'Third Owner':3,'Fourth Owner Or More':4}
dt 

#replace(1 , 2)

{'First Owner': 1,
 'Second Owner': 2,
 'Third Owner': 3,
 'Fourth Owner Or More': 4}

In [74]:
for owner in df['owner']:
    print(dt[owner])

In [78]:
df['owner2'] = df['owner'].map(dt)

In [81]:
df.head(40)

,bike_name,price,city,kms_driven,owner,age,power,brand,owner2
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS,1
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield,1
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph,1
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS,1
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha,1
5,Yamaha FZs 150cc,53499.0,Delhi,25000.0,First Owner,6.0,150.0,Yamaha,1
6,Honda CB Hornet 160R ABS DLX,85000.0,Delhi,8200.0,First Owner,3.0,160.0,Honda,1
7,Hero Splendor Plus Self Alloy 100cc,45000.0,Delhi,12645.0,First Owner,3.0,100.0,Hero,1
8,Royal Enfield Thunderbird X 350cc,145000.0,Bangalore,9190.0,First Owner,3.0,350.0,Royal Enfield,1
9,Royal Enfield Classic Desert Storm 500cc,88000.0,Delhi,19000.0,Second Owner,7.0,500.0,Royal Enfield,2
10,Yamaha YZF-R15 2.0 150cc,72000.0,Bangalore,20000.0,First Owner,7.0,150.0,Yamaha,1
11,Yamaha FZ25 250cc,95000.0,Bangalore,9665.0,First Owner,4.0,250.0,Yamaha,1
12,Bajaj Pulsar NS200,78000.0,Bangalore,9900.0,First Owner,4.0,200.0,Bajaj,1
13,Bajaj Discover 100M,29499.0,Delhi,20000.0,First Owner,8.0,100.0,Bajaj,1
14,Bajaj Discover 125M,29900.0,Delhi,20000.0,First Owner,7.0,125.0,Bajaj,1
15,Bajaj Pulsar NS200 ABS,90000.0,Bangalore,11574.0,First Owner,3.0,200.0,Bajaj,1
16,Bajaj Pulsar RS200 ABS,120000.0,Bangalore,23000.0,First Owner,3.0,200.0,Bajaj,1
17,Suzuki Gixxer SF 150cc,48000.0,Mumbai,24725.0,First Owner,5.0,150.0,Suzuki,1
18,Benelli 302R 300CC,240000.0,Mumbai,15025.0,Second Owner,3.0,302.0,Benelli,2
22,Hero Splendor iSmart Plus IBS 110cc,46500.0,Delhi,3500.0,First Owner,2.0,110.0,Hero,1
23,Royal Enfield Classic Chrome 500cc,121700.0,Kalyan,24520.0,First Owner,5.0,500.0,Royal Enfield,1
24,Yamaha FZ V 2.0 150cc,45000.0,Delhi,23000.0,First Owner,6.0,150.0,Yamaha,1
26,Hero Super Splendor 125cc,20000.0,Ahmedabad,29305.0,First Owner,16.0,125.0,Hero,1
27,Honda CBF Stunner 125cc,20800.0,Faridabad,30500.0,Second Owner,7.0,125.0,Honda,2
28,Bajaj Pulsar 150cc,50000.0,Bangalore,19000.0,First Owner,8.0,150.0,Bajaj,1
29,Honda X-Blade 160CC ABS,81200.0,Mettur,9100.0,First Owner,2.0,160.0,Honda,1
30,Bajaj Pulsar NS200,88000.0,Hyderabad,21914.0,First Owner,3.0,200.0,Bajaj,1
31,Yamaha YZF-R15 2.0 150cc,80000.0,Kaithal,20000.0,Second Owner,4.0,150.0,Yamaha,2
32,Bajaj Avenger 220cc,40900.0,Gurgaon,15000.0,First Owner,6.0,220.0,Bajaj,1
33,KTM RC 390cc,180000.0,Pune,17700.0,First Owner,4.0,390.0,KTM,1
34,Honda CB Unicorn 150cc,40000.0,Noida,30000.0,First Owner,8.0,150.0,Honda,1
35,KTM Duke 200cc,70000.0,Nashik,100000.0,Second Owner,8.0,200.0,KTM,2
36,Royal Enfield Classic 350cc,98800.0,Kochi,39000.0,First Owner,5.0,350.0,Royal Enfield,1
37,Honda CBR 150R 150cc,65000.0,Allahabad,43000.0,First Owner,6.0,150.0,Honda,1
38,Royal Enfield Thunderbird X 500cc,190500.0,Samastipur,4550.0,First Owner,2.0,500.0,Royal Enfield,1
39,KTM RC 200cc ABS,179000.0,Bangalore,3400.0,First Owner,2.0,200.0,KTM,1
40,Royal Enfield Thunderbird 350cc,70000.0,Nadiad,45000.0,First Owner,8.0,350.0,Royal Enfield,1
41,Bajaj Avenger 220cc,45000.0,Hyderabad,36100.0,First Owner,6.0,220.0,Bajaj,1
42,Royal Enfield Bullet Electra 350cc,78000.0,Lucknow,8500.0,First Owner,13.0,350.0,Royal Enfield,1
43,Bajaj Avenger Street 220 ABS,110000.0,Bangalore,2550.0,First Owner,2.0,220.0,Bajaj,1

In [82]:
df['owner'] = df['owner'].map(dt)

In [83]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand,owner2
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,1,3.0,110.0,TVS,1
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,1,4.0,350.0,Royal Enfield,1
2,Triumph Daytona 675R,600000.0,Delhi,110.0,1,8.0,675.0,Triumph,1
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,1,4.0,180.0,TVS,1
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,1,3.0,150.0,Yamaha,1
...,...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000.0,Delhi,48587.0,1,8.0,150.0,Hero,1
9369,Bajaj Avenger 220cc,35000.0,Bangalore,60000.0,1,9.0,220.0,Bajaj,1
9370,Harley-Davidson Street 750 ABS,450000.0,Jodhpur,3430.0,1,4.0,750.0,Harley-Davidson,1
9371,Bajaj Dominar 400 ABS,139000.0,Hyderabad,21300.0,1,4.0,400.0,Bajaj,1
9372,Bajaj Avenger Street 220,80000.0,Hyderabad,7127.0,1,5.0,220.0,Bajaj,1

## missing value handling

In [85]:
import numpy as np 
import  pandas as pd

In [86]:
data = {'A':[2,4,5,np.nan,78,np.nan,8],
       'B':[12,14,np.nan,78,np.nan,8,55],
       'C':[np.nan,4,5,78,np.nan,8,63],
        'D':[2,4,5,500,78,11,8]}
data

{'A': [2, 4, 5, nan, 78, nan, 8],
 'B': [12, 14, nan, 78, nan, 8, 55],
 'C': [nan, 4, 5, 78, nan, 8, 63],
 'D': [2, 4, 5, 500, 78, 11, 8]}

In [88]:
df

,bike_name,price,city,kms_driven,owner,age,power,brand,owner2
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,1,3.0,110.0,TVS,1
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,1,4.0,350.0,Royal Enfield,1
2,Triumph Daytona 675R,600000.0,Delhi,110.0,1,8.0,675.0,Triumph,1
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,1,4.0,180.0,TVS,1
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,1,3.0,150.0,Yamaha,1
...,...,...,...,...,...,...,...,...,...
9362,Hero Hunk Rear Disc 150cc,25000.0,Delhi,48587.0,1,8.0,150.0,Hero,1
9369,Bajaj Avenger 220cc,35000.0,Bangalore,60000.0,1,9.0,220.0,Bajaj,1
9370,Harley-Davidson Street 750 ABS,450000.0,Jodhpur,3430.0,1,4.0,750.0,Harley-Davidson,1
9371,Bajaj Dominar 400 ABS,139000.0,Hyderabad,21300.0,1,4.0,400.0,Bajaj,1
9372,Bajaj Avenger Street 220,80000.0,Hyderabad,7127.0,1,5.0,220.0,Bajaj,1

In [87]:
sample = pd.DataFrame(data)
sample

      A     B     C    D
0   2.0  12.0   NaN    2
1   4.0  14.0   4.0    4
2   5.0   NaN   5.0    5
3   NaN  78.0  78.0  500
4  78.0   NaN   NaN   78
5   NaN   8.0   8.0   11
6   8.0  55.0  63.0    8

In [89]:
sample.isnull().sum()

A    2
B    2
C    2
D    0
dtype: int64

In [90]:
sample.isnull().sum().sum()

6